Revit 2027 API
BoundaryConditions.GetCurve Method
 Returns curve that define geometry of the line boundary conditions.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Curve GetCurve()
Public Function GetCurve As Curve
public:
Curve^ GetCurve()
member GetCurve : unit -> Curve
Return Value
Curve
 The curve.
Exceptions
Exception | Condition
InvalidObjectException |  Boundary condition is not a BoundaryConditionsType::Line type.
Remarks
 Boundary conditions should be BoundaryConditionsType::Line type. Otherwise exception is thrown.
See Also
Reference
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace